using System;

namespace SeventeenLab
{
    class Program
    {
        static void Main(string[] args)
        {
            //1.	Напишите набор простейших классов для создания личных исключений,
            //возникающих при работе с объектом типа Student (Worker, Pencil, Animal, Cat …, см. л.р. №17, №18).
            //3.	Напишите главную программу, демонстрирующую обработку ошибок блоками try-catch.
            
            /* Person p1 = new Person();
            p1.Name = "John";
            Person p2 = null;

            Console.WriteLine("p1 = p2: {0}", p1.Equals(p2));*/
            //Personcs person = new Personcs();
            MyClient.Client();
            Console.ReadLine();

        }
    }
}
